portal/app/Models/AdminModel.php

SELECT *
FROM `investor`
---
public function countOnboardingInvestors()
{

	$query = $this->db->table('investor')->get();