portal/app/Models/GfaModel.php

public function getCurrentNotification($email){

        $builder = $this->db->table('notify');
        $builder->where('email', $email);
        $builder->where('status', 'new');
        $builder->orderBy('id', 'desc');
        $builder->limit(1);
        $query = $builder->get();
---
SELECT *
FROM `notify`
WHERE `email` = 'jkouakou+11@cipme.ci'
AND `status` = 'new'
ORDER BY `id` DESC
 LIMIT 1

public function getNotification($email){

        $builder = $this->db->table('notify');
        $builder->where('email', $email);
        $builder->where('status', 'new');
        $builder->limit(5);
        $query = $builder->get();
---
SELECT *
FROM `notify`
WHERE `email` = 'pouattara+pme08@cipme.ci'
AND `status` = 'new'
 LIMIT 5

public function countNotifyByEmail($email,$status){

    $builder = $this->db->table('notify');
   $builder->where('email',$email);
   $builder->where('status',$status);
   $query = $builder->get();
---
SELECT *
FROM `notify`
WHERE `email` = 'pouattara+pme08@cipme.ci'
AND `status` = 'new'

    public function getLoginDetails($email)
{
        $builder = $this->db->table('login');
        $builder->orderBy('id', 'desc');
        $builder->where('email', $email);
        $query = $builder->get();
---
SELECT *
FROM `login`
WHERE `email` = 'manuel@peakbuildingservices.com'
ORDER BY `id` DESC

public function getUser($email)
{
        $builder = $this->db->table('login');
        $builder->where('email', $email);
        $query = $builder->get();
---
SELECT *
FROM `login`
WHERE `email` = 'manuel@peakbuildingservices.com'

public function getStartUpDetails($email)
{
        $builder = $this->db->table('startups_inv');
        $builder->where('Contact_Email', $email);
        $query = $builder->get();
---
SELECT *
FROM `startups_inv`
WHERE `Contact_Email` IS NULL

public function countWeeklyReport($email)
{
    $query = $this->db->table('dcdt_report')
                    ->where('email', $email)
                    ->get();
---
SELECT *
FROM `dcdt_report`
WHERE `email` = 'jkouakou+11@cipme.ci'

public function getAllDcdtByEmail($email)
{
        $builder =$this->db->table('pms_ref_link');
        $builder ->where('email', $email);
        $builder ->where('ref', 'dcdt');
        $builder ->groupBy('id', "desc");
        $query = $builder->get();
---
SELECT *
FROM `pms_ref_link`
WHERE `email` = 'jkouakou+11@cipme.ci'
AND `ref` = 'dcdt'
GROUP BY `id`

    public function getCurrentSub($email,$subscription,$status)
{
        $builder = $this->db->table('package_sub');
        $builder->where('email', $email);
        $builder->where('subscription', $subscription);
        $builder->where('status', $status);
        $builder->orderBy('id', 'desc');
        $builder->limit(1);
        $query= $builder->get();
---
SELECT *
FROM `package_sub`
WHERE `email` = 'jkouakou+11@cipme.ci'
AND `subscription` = 'Basic Funding'
AND `status` = 'active'
ORDER BY `id` DESC
 LIMIT 1

public function getPhotoUploaded($email)
{
        $builder=$this->db->table('profile_photo');
        $builder->where('Email',$email);
        $builder->where('Upload_Type !=','logo');
        $builder->orderBy('Photo_id', 'DESC');
        $query=$builder->get();
---
SELECT *
FROM `profile_photo`
WHERE `Email` = 'jkouakou+11@cipme.ci'
AND `Upload_Type` != 'logo'
ORDER BY `Photo_id` DESC

public function getPaidSubscriber($email)
{
        $builder=$this->db->table('package_sub');
        $builder->where('email', $email);
        $builder->where('status', 'active');
        $builder->orderBy('id', 'desc');
        $query=$builder->get();
---
SELECT *
FROM `package_sub`
WHERE `email` = 'jkouakou+11@cipme.ci'
AND `status` = 'active'
ORDER BY `id` DESC

public function getAllRequestConnections($email)
{
    $builder = $this->db->table('all_connections');
    $builder->where('email', $email);
    $builder->where('status', 'pending');
    $builder->orderBy('id', 'ASC');
    $query = $builder->get();
---
SELECT *
FROM `all_connections`
WHERE `email` = 'jkouakou+11@cipme.ci'
AND `status` = 'pending'
ORDER BY `id` ASC

public function countStartupConnect($email,$connect)
{
        $builder = $this->db->table('all_connections');
        $builder->where('email_startup', $email);
        $builder->where('connection', $connect);
        $query=$builder->get();
---
SELECT *
FROM `all_connections`
WHERE `email_startup` = 'jkouakou+11@cipme.ci'
AND `connection` = 'startup-mentor'

public function countFileUploded($email)
{
        $builder=$this->db->table('files');
        $builder->where('Email', $email);
        $query=$builder->get();
---
SELECT *
FROM `files`
WHERE `Email` = 'jkouakou+11@cipme.ci'

public function countAllStory()
{
    $builder = $this->db->table('story');
    $builder->where('status', 'active');
    $count_row = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `story`
WHERE `status` = 'active'

public function getEventByEmailLimit($limit)
{
    $builder = $this->db->table('event');
    $builder->orderBy('event_id', 'desc');
    $builder->where('status', 'active');
    $builder->limit($limit);
    $query = $builder->get();
---
SELECT *
FROM `event`
WHERE `status` = 'active'
ORDER BY `event_id` DESC
 LIMIT 2

public function getEventByTitle($ref_id)
{
    $builder = $this->db->table('event');
    $builder->orderBy('event_id', 'desc');
    $builder->where('ref_id', $ref_id);
    $query = $builder->get();
---
SELECT *
FROM `event`
WHERE `ref_id` = '1680529841'
ORDER BY `event_id` DESC

public function getAllCsr()
{
    $builder = $this->db->table('csr');
    $builder->orderBy('csr_id', 'desc');
    $builder->where('status', 'active');

    $query = $builder->get();
---
SELECT *
FROM `csr`
WHERE `status` = 'active'
ORDER BY `csr_id` DESC

    function insertUserActivity($data) {
        $builder = $this->db->table('user_activity');
        $query = $builder->insert($data);
---
INSERT INTO `user_activity` (`UserAction`, `UserIp`, `UserId`, `UserEmail`, `DateCreated`) VALUES (NULL, '127.0.0.1', '', NULL, '2026-02-02 17:29:53')